console.log("Ваша оценка - 92 балла");
console.log("Отзыв по пунктам ТЗ:");
console.log("Не выполненные/не засчитанные пункты:");
console.log("1) При уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону. Фон за рамками страницы может быть черным, белым или любого оттенка серого.");
console.log("2) Плавная прокрутка по якорям.");
console.log("Частично выполненные пункты:");
console.log("1) Секция `Favorites` Интерактивные кнопки дожны иметь структуру input type=\"radio\" + label. Добавьте небольшую область вокруг кнопки и надписи (например, 5px как в примере секции `about`) для того, чтобы была возможность легче наводить мышку. Картинок и описаний - много, для 4х секций. Их стоит добавить в проект. А лучше сразу на страницу, и скрыть с помощью CSS свойств, например display: none;. Кнопки \"buy\" должны быть интерактивными, плавно менять свой цвет при наведении на них, как указано в макете styleguides. Кнопка \"own\" не должна быть интерактивной, не должна нажиматься. И на ней должен присутствовать атрибут disabled.");